@echo off
set minombre=%~n0
set escape=\
set texto=

:recopilacion
set "texto=%texto% %~1"
shift
if [%1] NEQ [] goto recopilacion
set texto=%texto:~1%
if "%texto%" EQU "" goto error

set fila=0
set desde=0
set especial=n
:fila
set linea=
set lineaprevia=
set columna=0
:columna
set mat=//////////////////////////ÛÛÛ/////ÛÛÛ///////////////////////////
call set l=%%texto:~%columna%,1%%
if "%l%" EQU "" if "%especial%" EQU "s" (set l=x) else (goto finfila)
if "%especial%" EQU "s" (
	set l=*%l%
	set especial=n
) else if "%l%" EQU "%escape%" (
	set /a columna+=1
	set especial=s
	goto columna 
)
if %fila% EQU 0 set lineaprevia=%lineaprevia%////////

@      if "%l%"==" "  (set mat=////////////////////////////////////////////////////////////////
) else if "%l%"=="!"  (set mat=///ÛÛ/////ÛÛÛÛ////ÛÛÛÛ/////ÛÛ//////ÛÛ//////////////ÛÛ///////////
) else if "%l%"=="*'" (set mat=/ÛÛ/ÛÛ///ÛÛ/ÛÛ///ÛÛ/ÛÛ//////////////////////////////////////////
) else if "%l%"=="#"  (set mat=/ÛÛ/ÛÛ///ÛÛ/ÛÛ//ÛÛÛÛÛÛÛ//ÛÛ/ÛÛ//ÛÛÛÛÛÛÛ//ÛÛ/ÛÛ///ÛÛ/ÛÛ//////////
) else if "%l%"=="$"  (set mat=///ÛÛ/////ÛÛÛÛÛ//ÛÛ///////ÛÛÛÛ///////ÛÛ//ÛÛÛÛÛ/////ÛÛ///////////
) else if "%l%"=="%%" (set mat=////////ÛÛ///ÛÛ/ÛÛ//ÛÛ/////ÛÛ/////ÛÛ/////ÛÛ//ÛÛ/ÛÛ///ÛÛ/////////
) else if "%l%"=="&"  (set mat=//ÛÛÛ////ÛÛ/ÛÛ////ÛÛÛ////ÛÛÛ/ÛÛ/ÛÛ/ÛÛÛ//ÛÛ//ÛÛ///ÛÛÛ/ÛÛ/////////
) else if "%l%"=="'"  (set mat=///ÛÛ//////ÛÛ/////ÛÛ////////////////////////////////////////////
) else if "%l%"=="("  (set mat=////ÛÛ/////ÛÛ/////ÛÛ//////ÛÛ//////ÛÛ///////ÛÛ///////ÛÛ//////////
) else if "%l%"=="*(" (set mat=//ÛÛ///////ÛÛ///////ÛÛ//////ÛÛ//////ÛÛ/////ÛÛ/////ÛÛ////////////
) else if "%l%"=="*"  (set mat=/////////ÛÛ//ÛÛ///ÛÛÛÛ//ÛÛÛÛÛÛÛÛ//ÛÛÛÛ///ÛÛ//ÛÛ/////////////////
) else if "%l%"=="+"  (set mat=///////////ÛÛ//////ÛÛ////ÛÛÛÛÛÛ////ÛÛ//////ÛÛ///////////////////
) else if "%l%"==","  (set mat=///////////////////////////////////////////ÛÛ//////ÛÛ/////ÛÛ////
) else if "%l%"=="-"  (set mat=/////////////////////////ÛÛÛÛÛÛ/////////////////////////////////
) else if "%l%"=="."  (set mat=///////////////////////////////////////////ÛÛ//////ÛÛ///////////
) else if "%l%"=="/"  (set mat=/////ÛÛ/////ÛÛ/////ÛÛ/////ÛÛ/////ÛÛ/////ÛÛ//////Û///////////////
) else if "%l%"=="0"  (set mat=/ÛÛÛÛÛ//ÛÛ///ÛÛ/ÛÛ//ÛÛÛ/ÛÛ/ÛÛÛÛ/ÛÛÛÛ/ÛÛ/ÛÛÛ//ÛÛ//ÛÛÛÛÛ//////////
) else if "%l%"=="1"  (set mat=///ÛÛ/////ÛÛÛ//////ÛÛ//////ÛÛ//////ÛÛ//////ÛÛ////ÛÛÛÛÛÛ/////////
) else if "%l%"=="2"  (set mat=//ÛÛÛÛ///ÛÛ//ÛÛ//////ÛÛ////ÛÛÛ////ÛÛ/////ÛÛ//ÛÛ//ÛÛÛÛÛÛ/////////
) else if "%l%"=="3"  (set mat=//ÛÛÛÛ///ÛÛ//ÛÛ//////ÛÛ////ÛÛÛ///////ÛÛ//ÛÛ//ÛÛ///ÛÛÛÛ//////////
) else if "%l%"=="4"  (set mat=///ÛÛÛ////ÛÛÛÛ///ÛÛ/ÛÛ//ÛÛ//ÛÛ//ÛÛÛÛÛÛÛ/////ÛÛ/////ÛÛÛÛ/////////
) else if "%l%"=="5"  (set mat=/ÛÛÛÛÛÛ//ÛÛ//////ÛÛÛÛÛ///////ÛÛ//////ÛÛ//ÛÛ//ÛÛ///ÛÛÛÛ//////////
) else if "%l%"=="6"  (set mat=///ÛÛÛ////ÛÛ/////ÛÛ//////ÛÛÛÛÛ///ÛÛ//ÛÛ//ÛÛ//ÛÛ///ÛÛÛÛ//////////
) else if "%l%"=="7"  (set mat=/ÛÛÛÛÛÛ//ÛÛ//ÛÛ//////ÛÛ/////ÛÛ/////ÛÛ//////ÛÛ//////ÛÛ///////////
) else if "%l%"=="8"  (set mat=//ÛÛÛÛ///ÛÛ//ÛÛ//ÛÛ//ÛÛ///ÛÛÛÛ///ÛÛ//ÛÛ//ÛÛ//ÛÛ///ÛÛÛÛ//////////
) else if "%l%"=="9"  (set mat=//ÛÛÛÛ///ÛÛ//ÛÛ//ÛÛ//ÛÛ///ÛÛÛÛÛ//////ÛÛ/////ÛÛ////ÛÛÛ///////////
) else if "%l%"==":"  (set mat=///////////ÛÛ//////ÛÛ//////////////////////ÛÛ//////ÛÛ///////////
) else if "%l%"==";"  (set mat=///////////ÛÛ//////ÛÛ//////////////////////ÛÛ//////ÛÛ/////ÛÛ////
) else if "%l%"=="*m" (set mat=////ÛÛ/////ÛÛ/////ÛÛ/////ÛÛ///////ÛÛ///////ÛÛ///////ÛÛ//////////
) else if "%l%"=="="  (set mat=/////////////////ÛÛÛÛÛÛ//////////////////ÛÛÛÛÛÛ/////////////////
) else if "%l%"=="*M" (set mat=/ÛÛ///////ÛÛ///////ÛÛ///////ÛÛ/////ÛÛ/////ÛÛ/////ÛÛ/////////////
) else if "%l%"=="?"  (set mat=//ÛÛÛÛ///ÛÛ//ÛÛ//////ÛÛ/////ÛÛ/////ÛÛ//////////////ÛÛ///////////
) else if "%l%"=="@"  (set mat=/ÛÛÛÛÛ//ÛÛ///ÛÛ/ÛÛ/ÛÛÛÛ/ÛÛ/ÛÛÛÛ/ÛÛ/ÛÛÛÛ/ÛÛ///////ÛÛÛÛ///////////
) else if "%l%"=="A"  (set mat=///ÛÛ/////ÛÛÛÛ///ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛÛÛÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ/////////
) else if "%l%"=="B"  (set mat=ÛÛÛÛÛÛ///ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛÛÛÛ///ÛÛ//ÛÛ//ÛÛ//ÛÛ/ÛÛÛÛÛÛ//////////
) else if "%l%"=="C"  (set mat=//ÛÛÛÛ///ÛÛ//ÛÛ/ÛÛ//////ÛÛ//////ÛÛ///////ÛÛ//ÛÛ///ÛÛÛÛ//////////
) else if "%l%"=="D"  (set mat=ÛÛÛÛÛ////ÛÛ/ÛÛ///ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ/ÛÛ//ÛÛÛÛÛ///////////
) else if "%l%"=="E"  (set mat=ÛÛÛÛÛÛÛ//ÛÛ///Û//ÛÛ/Û////ÛÛÛÛ////ÛÛ/Û////ÛÛ///Û/ÛÛÛÛÛÛÛ/////////
) else if "%l%"=="F"  (set mat=ÛÛÛÛÛÛÛ//ÛÛ///Û//ÛÛ/Û////ÛÛÛÛ////ÛÛ/Û////ÛÛ/////ÛÛÛÛ////////////
) else if "%l%"=="G"  (set mat=//ÛÛÛÛ///ÛÛ//ÛÛ/ÛÛ//////ÛÛ//////ÛÛ//ÛÛÛ//ÛÛ//ÛÛ///ÛÛÛÛÛ/////////
) else if "%l%"=="H"  (set mat=/ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛÛÛÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ/////////
) else if "%l%"=="I"  (set mat=//ÛÛÛÛ/////ÛÛ//////ÛÛ//////ÛÛ//////ÛÛ//////ÛÛ/////ÛÛÛÛ//////////
) else if "%l%"=="J"  (set mat=///ÛÛÛÛ/////ÛÛ//////ÛÛ//////ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ///ÛÛÛÛ///////////
) else if "%l%"=="K"  (set mat=ÛÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ/ÛÛ///ÛÛÛÛ////ÛÛ/ÛÛ///ÛÛ//ÛÛ/ÛÛÛ//ÛÛ/////////
) else if "%l%"=="L"  (set mat=ÛÛÛÛ/////ÛÛ//////ÛÛ//////ÛÛ//////ÛÛ///Û//ÛÛ//ÛÛ/ÛÛÛÛÛÛÛ/////////
) else if "%l%"=="M"  (set mat=ÛÛ///ÛÛ/ÛÛÛ/ÛÛÛ/ÛÛÛÛÛÛÛ/ÛÛÛÛÛÛÛ/ÛÛ/Û/ÛÛ/ÛÛ///ÛÛ/ÛÛ///ÛÛ/////////
) else if "%l%"=="N"  (set mat=ÛÛ///ÛÛ/ÛÛÛ//ÛÛ/ÛÛÛÛ/ÛÛ/ÛÛ/ÛÛÛÛ/ÛÛ//ÛÛÛ/ÛÛ///ÛÛ/ÛÛ///ÛÛ/////////
) else if "%l%"=="O"  (set mat=//ÛÛÛ////ÛÛ/ÛÛ//ÛÛ///ÛÛ/ÛÛ///ÛÛ/ÛÛ///ÛÛ//ÛÛ/ÛÛ////ÛÛÛ///////////
) else if "%l%"=="P"  (set mat=ÛÛÛÛÛÛ///ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛÛÛÛ///ÛÛ//////ÛÛ/////ÛÛÛÛ////////////
) else if "%l%"=="Q"  (set mat=//ÛÛÛÛ///ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ/ÛÛÛ///ÛÛÛÛ//////ÛÛÛ/////////
) else if "%l%"=="R"  (set mat=ÛÛÛÛÛÛ///ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛÛÛÛ///ÛÛ/ÛÛ///ÛÛ//ÛÛ/ÛÛÛ//ÛÛ/////////
) else if "%l%"=="S"  (set mat=//ÛÛÛÛ///ÛÛ//ÛÛ//ÛÛÛ//////ÛÛÛ///////ÛÛÛ//ÛÛ//ÛÛ///ÛÛÛÛ//////////
) else if "%l%"=="T"  (set mat=/ÛÛÛÛÛÛ//Û/ÛÛ/Û////ÛÛ//////ÛÛ//////ÛÛ//////ÛÛ/////ÛÛÛÛ//////////
) else if "%l%"=="U"  (set mat=/ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛÛÛÛÛ/////////
) else if "%l%"=="V"  (set mat=/ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ///ÛÛÛÛ/////ÛÛ///////////
) else if "%l%"=="W"  (set mat=ÛÛ///ÛÛ/ÛÛ///ÛÛ/ÛÛ///ÛÛ/ÛÛ/Û/ÛÛ/ÛÛÛÛÛÛÛ/ÛÛÛ/ÛÛÛ/ÛÛ///ÛÛ/////////
) else if "%l%"=="X"  (set mat=ÛÛ///ÛÛ/ÛÛ///ÛÛ//ÛÛ/ÛÛ////ÛÛÛ/////ÛÛÛ////ÛÛ/ÛÛ//ÛÛ///ÛÛ/////////
) else if "%l%"=="Y"  (set mat=/ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ///ÛÛÛÛ/////ÛÛ//////ÛÛ/////ÛÛÛÛ//////////
) else if "%l%"=="Z"  (set mat=ÛÛÛÛÛÛÛ/ÛÛ///ÛÛ/Û///ÛÛ/////ÛÛ/////ÛÛ//Û//ÛÛ//ÛÛ/ÛÛÛÛÛÛÛ/////////
) else if "%l%"=="["  (set mat=//ÛÛÛÛ////ÛÛ//////ÛÛ//////ÛÛ//////ÛÛ//////ÛÛ//////ÛÛÛÛ//////////
) else if "%l%"=="*\" (set mat=ÛÛ///////ÛÛ///////ÛÛ///////ÛÛ///////ÛÛ///////ÛÛ///////Û/////////
) else if "%l%"=="]"  (set mat=//ÛÛÛÛ//////ÛÛ//////ÛÛ//////ÛÛ//////ÛÛ//////ÛÛ////ÛÛÛÛ//////////
) else if "%l%"=="*`" (set mat=///Û//////ÛÛÛ////ÛÛ/ÛÛ//ÛÛ///ÛÛ/////////////////////////////////
) else if "%l%"=="_"  (set mat=////////////////////////////////////////////////////////ÛÛÛÛÛÛÛÛ
) else if "%l%"=="`"  (set mat=//ÛÛ//////ÛÛ///////ÛÛ///////////////////////////////////////////
) else if "%l%"=="a"  (set mat=/////////////////ÛÛÛÛ///////ÛÛ///ÛÛÛÛÛ//ÛÛ//ÛÛ///ÛÛÛ/ÛÛ/////////
) else if "%l%"=="b"  (set mat=ÛÛÛ//////ÛÛ//////ÛÛ//////ÛÛÛÛÛ///ÛÛ//ÛÛ//ÛÛ//ÛÛ/ÛÛ/ÛÛÛ//////////
) else if "%l%"=="c"  (set mat=//////////////////ÛÛÛÛ///ÛÛ//ÛÛ//ÛÛ//////ÛÛ//ÛÛ///ÛÛÛÛ//////////
) else if "%l%"=="d"  (set mat=///ÛÛÛ//////ÛÛ//////ÛÛ///ÛÛÛÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ///ÛÛÛ/ÛÛ/////////
) else if "%l%"=="e"  (set mat=//////////////////ÛÛÛÛ///ÛÛ//ÛÛ//ÛÛÛÛÛÛ//ÛÛ///////ÛÛÛÛ//////////
) else if "%l%"=="f"  (set mat=///ÛÛÛ////ÛÛ/ÛÛ///ÛÛ/////ÛÛÛÛ/////ÛÛ//////ÛÛ/////ÛÛÛÛ///////////
) else if "%l%"=="g"  (set mat=/////////////////ÛÛÛ/ÛÛ/ÛÛ//ÛÛ//ÛÛ//ÛÛ///ÛÛÛÛÛ//////ÛÛ//ÛÛÛÛÛ///
) else if "%l%"=="h"  (set mat=ÛÛÛ//////ÛÛ//////ÛÛ/ÛÛ///ÛÛÛ/ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ/ÛÛÛ//ÛÛ/////////
) else if "%l%"=="i"  (set mat=///ÛÛ/////////////ÛÛÛ//////ÛÛ//////ÛÛ//////ÛÛ/////ÛÛÛÛ//////////
) else if "%l%"=="j"  (set mat=/////ÛÛ//////////////ÛÛ//////ÛÛ//////ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ///ÛÛÛÛ//
) else if "%l%"=="k"  (set mat=ÛÛÛ//////ÛÛ//////ÛÛ//ÛÛ//ÛÛ/ÛÛ///ÛÛÛÛ////ÛÛ/ÛÛ//ÛÛÛ//ÛÛ/////////
) else if "%l%"=="l"  (set mat=//ÛÛÛ//////ÛÛ//////ÛÛ//////ÛÛ//////ÛÛ//////ÛÛ/////ÛÛÛÛ//////////
) else if "%l%"=="m"  (set mat=////////////////ÛÛ//ÛÛ//ÛÛÛÛÛÛÛ/ÛÛÛÛÛÛÛ/ÛÛ/Û/ÛÛ/ÛÛ///ÛÛ/////////
) else if "%l%"=="n"  (set mat=/////////////////ÛÛÛÛÛ///ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ/////////
) else if "%l%"=="o"  (set mat=//////////////////ÛÛÛÛ///ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ///ÛÛÛÛ//////////
) else if "%l%"=="p"  (set mat=////////////////ÛÛ/ÛÛÛ///ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛÛÛÛ///ÛÛ/////ÛÛÛÛ////
) else if "%l%"=="q"  (set mat=/////////////////ÛÛÛ/ÛÛ/ÛÛ//ÛÛ//ÛÛ//ÛÛ///ÛÛÛÛÛ//////ÛÛ/////ÛÛÛÛ/
) else if "%l%"=="r"  (set mat=////////////////ÛÛ/ÛÛÛ///ÛÛÛ/ÛÛ//ÛÛ//ÛÛ//ÛÛ/////ÛÛÛÛ////////////
) else if "%l%"=="s"  (set mat=//////////////////ÛÛÛÛÛ//ÛÛ///////ÛÛÛÛ///////ÛÛ//ÛÛÛÛÛ//////////
) else if "%l%"=="t"  (set mat=///Û//////ÛÛ/////ÛÛÛÛÛ////ÛÛ//////ÛÛ//////ÛÛ/Û/////ÛÛ///////////
) else if "%l%"=="u"  (set mat=////////////////ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ///ÛÛÛ/ÛÛ/////////
) else if "%l%"=="v"  (set mat=/////////////////ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ///ÛÛÛÛ/////ÛÛ///////////
) else if "%l%"=="w"  (set mat=////////////////ÛÛ///ÛÛ/ÛÛ/Û/ÛÛ/ÛÛÛÛÛÛÛ/ÛÛÛÛÛÛÛ//ÛÛ/ÛÛ//////////
) else if "%l%"=="x"  (set mat=////////////////ÛÛ///ÛÛ//ÛÛ/ÛÛ////ÛÛÛ////ÛÛ/ÛÛ//ÛÛ///ÛÛ/////////
) else if "%l%"=="y"  (set mat=/////////////////ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ///ÛÛÛÛÛ//////ÛÛ//ÛÛÛÛÛ//
) else if "%l%"=="z"  (set mat=/////////////////ÛÛÛÛÛÛ//Û//ÛÛ/////ÛÛ/////ÛÛ//Û//ÛÛÛÛÛÛ/////////
) else if "%l%"=="{"  (set mat=////ÛÛÛ////ÛÛ//////ÛÛ////ÛÛÛ///////ÛÛ//////ÛÛ///////ÛÛÛ/////////
) else if "%l%"=="*p" (set mat=///ÛÛ//////ÛÛ//////ÛÛ//////////////ÛÛ//////ÛÛ//////ÛÛ///////////
) else if "%l%"=="}"  (set mat=/ÛÛÛ///////ÛÛ//////ÛÛ///////ÛÛÛ////ÛÛ//////ÛÛ////ÛÛÛ////////////
) else if "%l%"=="~"  (set mat=/ÛÛÛ/ÛÛ/ÛÛ/ÛÛÛ//////////////////////////////////////////////////
) else if "%l%"=="*P" (set mat=///ÛÛ//////ÛÛ//////ÛÛ//////ÛÛ//////ÛÛ//////ÛÛ//////ÛÛ//////ÛÛ///
) else if "%l%"=="*e" (set mat=////ÛÛÛ///////////ÛÛÛÛ///ÛÛ//ÛÛ//ÛÛÛÛÛÛ//ÛÛ///////ÛÛÛÛ//////////
) else if "%l%"=="*E" (set mat=////ÛÛÛ//////////ÛÛÛÛÛÛ///ÛÛ//////ÛÛÛÛ////ÛÛ/////ÛÛÛÛÛÛ/////////
) else if "%l%"=="*a" (set mat=///ÛÛÛ///////////ÛÛÛÛ///////ÛÛ///ÛÛÛÛÛ//ÛÛ//ÛÛ///ÛÛÛÛÛÛ/////////
) else if "%l%"=="*i" (set mat=///ÛÛÛ////////////ÛÛÛ//////ÛÛ//////ÛÛ//////ÛÛ/////ÛÛÛÛ//////////
) else if "%l%"=="*o" (set mat=////////////ÛÛÛ///////////ÛÛÛÛ///ÛÛ//ÛÛ//ÛÛ//ÛÛ///ÛÛÛÛ//////////
) else if "%l%"=="*u" (set mat=///////////ÛÛÛ//////////ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ///ÛÛÛÛÛÛ/////////
) else if "%l%"=="*n" (set mat=/////////ÛÛÛÛÛ///////////ÛÛÛÛÛ///ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ//ÛÛ/////////
) else if "%l%"=="*N" (set mat=/ÛÛÛÛÛÛ//////////ÛÛ//ÛÛ//ÛÛÛ/ÛÛ//ÛÛÛÛÛÛ//ÛÛ/ÛÛÛ//ÛÛ//ÛÛ/////////
) else if "%l%"=="*?" (set mat=///ÛÛ//////////////ÛÛ/////ÛÛ/////ÛÛ//////ÛÛ//ÛÛ///ÛÛÛÛ//////////
) else if "%l%"=="*!" (set mat=///ÛÛ//////ÛÛ//////////////ÛÛ//////ÛÛ//////ÛÛ//////ÛÛ///////////)

:lotengo
set /a columna=%columna%+1
call set trozo=%%mat:~%desde%,8%%
set linea=%linea%%trozo%
goto columna

:finfila
if %fila% EQU 0 echo %lineaprevia%
echo %linea%
set /a fila+=1
set /a desde+=8
if %fila% NEQ 8 goto fila
goto :EOF

:error
echo uso: %minombre% cadena de texto
echo      entrecomillar la cadena te permite poner espacios en cualquier lado
echo      los caracteres especiales se ponen con %escape% seguido de otro caracter:
echo      " - %escape%'      ) - %escape%(      < - %escape%m      > - %escape%M      | - %escape%p      ³ - %escape%P
echo        - %escape%a      ‚ - %escape%e      ¡ - %escape%i      ¢ - %escape%o      £ - %escape%u       - %escape%E
echo      ¤ - %escape%n      ¥ - %escape%N      ^^ - %escape%`      ­ - %escape%!      ¨ - %escape%?      %escape% - %escape%%escape%
goto :EOF
